src/simd.org
#+title: SIMD

从Pentium II和Pentium MMX处理器系列开始,芯片开始支持SIMD操作.
SIMD全称是Single Instruction Multiple Data,即单指令多数据,
可以在一个周期内操作多个数据.

** 指令集
*** MMX
   - Multimedia Extensions.[PII & PMMX]
   - (CPUID.01H:EDX.MMX[bit 23]=1)

*** SSE.
   - Streaming SIMD Extensions.[PIII]
   - (CPUID.01H:EDX.SSE[bit 25]=1)

*** SSE2
   - Streaming SIMD Extensions2.[P4 & Xeon]
   - (CPUID.01H:EDX.SSE2[bit 26]=1)

*** SSE3
   - Streaming SIMD Extensions3.[P4(HT)]
   - (CPUID.01H:ECX.SSE3[bit 0]=1)

*** SSSE3
   - Supplemental Stream SIMD Extensions3.[Xeon(5100) & Core2]
   - (CPUID.01H:ECX.SSSE3[bit 9]=1)

*** SSE4
   - Streaming SIMD Extensions4.[Xeon(5400) & Core2Ex(QX9650)]
   - SSE4.1.(CPUID.01H:ECX.SSE4_1[bit 19]=1)
   - SSE4.2.(CPUID.01H:ECX.SSE4_2[bit 20]=1)

