simd.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>SIMD</title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="dirtysalt" />
<link rel="shortcut icon" href="http://dirtysalt.info/css/favicon.ico" />
<link rel="stylesheet" type="text/css" href="./css/site.css" />
</head>
<body>
<div id="content">
<h1 class="title">SIMD</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline8">1. 指令集</a>
<ul>
<li><a href="#orgheadline1">1.1. MMX</a></li>
<li><a href="#orgheadline2">1.2. SSE.</a></li>
<li><a href="#orgheadline3">1.3. SSE2</a></li>
<li><a href="#orgheadline4">1.4. SSE3</a></li>
<li><a href="#orgheadline5">1.5. SSSE3</a></li>
<li><a href="#orgheadline6">1.6. SSE4</a></li>
<li><a href="#orgheadline7">1.7. 检测代码</a></li>
</ul>
</li>
<li><a href="#orgheadline20">2. 基本概念</a>
<ul>
<li><a href="#orgheadline9">2.1. %mm寄存器</a></li>
<li><a href="#orgheadline10">2.2. %xmm寄存器</a></li>
<li><a href="#orgheadline11">2.3. %mxcsr寄存器</a></li>
<li><a href="#orgheadline12">2.4. Saturation &amp; Wraparound</a></li>
<li><a href="#orgheadline13">2.5. General Purpose Register(GPR)</a></li>
<li><a href="#orgheadline14">2.6. X87 FPU</a></li>
<li><a href="#orgheadline15">2.7. Packed &amp; Scalar Instructions</a></li>
<li><a href="#orgheadline16">2.8. Temporal &amp; NonTemporal Data</a></li>
<li><a href="#orgheadline17">2.9. Alignment</a></li>
<li><a href="#orgheadline18">2.10. Asymmetric &amp; Horizontal Processing</a></li>
<li><a href="#orgheadline19">2.11. Zero Fill &amp; Truncated</a></li>
</ul>
</li>
<li><a href="#orgheadline56">3. 指令</a>
<ul>
<li><a href="#orgheadline27">3.1. Data Transfer Instructions</a>
<ul>
<li><a href="#orgheadline21">3.1.1. Move Mask Instructions</a></li>
<li><a href="#orgheadline22">3.1.2. Move Integer Instructions</a></li>
<li><a href="#orgheadline23">3.1.3. Move Float Instructions</a></li>
<li><a href="#orgheadline24">3.1.4. Move Double Instructions</a></li>
<li><a href="#orgheadline25">3.1.5. Move Duplication Instructions</a></li>
<li><a href="#orgheadline26">3.1.6. Move NonTemporal Instructions</a></li>
</ul>
</li>
<li><a href="#orgheadline40">3.2. Arithmetic Instructions</a>
<ul>
<li><a href="#orgheadline30">3.2.1. ADD Instructions</a></li>
<li><a href="#orgheadline33">3.2.2. SUB Instructions</a></li>
<li><a href="#orgheadline34">3.2.3. MUL Instructions</a></li>
<li><a href="#orgheadline35">3.2.4. DIV Instructions</a></li>
<li><a href="#orgheadline38">3.2.5. M?X Instructions</a></li>
<li><a href="#orgheadline39">3.2.6. Math Instructions</a></li>
</ul>
</li>
<li><a href="#orgheadline41">3.3. Comparison Instructions</a></li>
<li><a href="#orgheadline42">3.4. Conversion Instructions</a></li>
<li><a href="#orgheadline43">3.5. Insert &amp; Unpack Instructions</a></li>
<li><a href="#orgheadline44">3.6. Logical Instructions</a></li>
<li><a href="#orgheadline45">3.7. Shift Instructions</a></li>
<li><a href="#orgheadline46">3.8. Shuffle Instructions</a></li>
<li><a href="#orgheadline47">3.9. Blending Instructions</a></li>
<li><a href="#orgheadline48">3.10. String Instructions</a></li>
<li><a href="#orgheadline55">3.11. MISC Instructions</a>
<ul>
<li><a href="#orgheadline49">3.11.1. Cache Control Instructions</a></li>
<li><a href="#orgheadline50">3.11.2. Prefetch Instructions</a></li>
<li><a href="#orgheadline51">3.11.3. Memory Ordering Instructions</a></li>
<li><a href="#orgheadline52">3.11.4. X87 FPU Instructions</a></li>
<li><a href="#orgheadline53">3.11.5. Thread Sync Instructions</a></li>
<li><a href="#orgheadline54">3.11.6. 其他</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<p>
从Pentium II和Pentium MMX处理器系列开始,芯片开始支持SIMD操作.
SIMD全称是Single Instruction Multiple Data,即单指令多数据,
可以在一个周期内操作多个数据.
</p>

<div id="outline-container-orgheadline8" class="outline-2">
<h2 id="orgheadline8"><span class="section-number-2">1</span> 指令集</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-orgheadline1" class="outline-3">
<h3 id="orgheadline1"><span class="section-number-3">1.1</span> MMX</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>Multimedia Extensions.[PII &amp; PMMX]</li>
<li>(CPUID.01H:EDX.MMX[bit 23]=1)</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline2" class="outline-3">
<h3 id="orgheadline2"><span class="section-number-3">1.2</span> SSE.</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>Streaming SIMD Extensions.[PIII]</li>
<li>(CPUID.01H:EDX.SSE[bit 25]=1)</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline3" class="outline-3">
<h3 id="orgheadline3"><span class="section-number-3">1.3</span> SSE2</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li>Streaming SIMD Extensions2.[P4 &amp; Xeon]</li>
<li>(CPUID.01H:EDX.SSE2[bit 26]=1)</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline4" class="outline-3">
<h3 id="orgheadline4"><span class="section-number-3">1.4</span> SSE3</h3>
<div class="outline-text-3" id="text-1-4">
<ul class="org-ul">
<li>Streaming SIMD Extensions3.[P4(HT)]</li>
<li>(CPUID.01H:ECX.SSE3[bit 0]=1)</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline5" class="outline-3">
<h3 id="orgheadline5"><span class="section-number-3">1.5</span> SSSE3</h3>
<div class="outline-text-3" id="text-1-5">
<ul class="org-ul">
<li>Supplemental Stream SIMD Extensions3.[Xeon(5100) &amp; Core2]</li>
<li>(CPUID.01H:ECX.SSSE3[bit 9]=1)</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline6" class="outline-3">
<h3 id="orgheadline6"><span class="section-number-3">1.6</span> SSE4</h3>
<div class="outline-text-3" id="text-1-6">
<ul class="org-ul">
<li>Streaming SIMD Extensions4.[Xeon(5400) &amp; Core2Ex(QX9650)]</li>
<li>SSE4.1.(CPUID.01H:ECX.SSE4_1[bit 19]=1)</li>
<li>SSE4.2.(CPUID.01H:ECX.SSE4_2[bit 20]=1)</li>
</ul>
</div>
</div>
