src/simd.org
*** 检测代码
#+BEGIN_SRC C++
/***************************************************************************
 *
 * Copyright (c) Baidu.com, Inc. All Rights Reserved
 *
 **************************************************************************/


/**
 * @file   detect.c
 * @author zhangyan04(@baidu.com)
 * @brief
 *
 */

#include <stdio.h>
int check_support_mmx(){
    int res=0;
    __asm__ __volatile__(
        "movl $1,%%eax\n\t"
        "cpuid\n\t"
        "test $0x800000,%%edx\n\t"
        "jz 1f\n\t"
        "movl $1,%0\n\t"
        "1:\n\t"
        :"=m"(res)
        ::"eax","edx");
    return res;
}
int check_support_sse(){
    int res=0;
    __asm__ __volatile__(
        "movl $1,%%eax\n\t"
        "cpuid\n\t"
        "test $0x02000000,%%edx\n\t"
        "jz 1f\n\t"
        "movl $1,%0\n\t"
        "1:\n\t"
        :"=m"(res)
        ::"eax","edx");
    return res;
}
int check_support_sse2(){
    int res=0;
    __asm__ __volatile__(
        "movl $1,%%eax\n\t"
        "cpuid\n\t"
        "test $0x04000000,%%edx\n\t"
        "jz 1f\n\t"
        "movl $1,%0\n\t"
        "1:\n\t"
        :"=m"(res)
        ::"eax","edx");
    return res;
}
int check_support_sse3(){
    int res=0;
    __asm__ __volatile__(
        "movl $1,%%eax\n\t"
        "cpuid\n\t"
        "test $0x1,%%ecx\n\t"
        "jz 1f\n\t"
        "movl $1,%0\n\t"
        "1:\n\t"
        :"=m"(res)
        ::"eax","edx");
    return res;
}
int check_support_ssse3(){
    int res=0;
    __asm__ __volatile__(
        "movl $1,%%eax\n\t"
        "cpuid\n\t"
        "test $0x0200,%%ecx\n\t"
        "jz 1f\n\t"
        "movl $1,%0\n\t"
        "1:\n\t"
        :"=m"(res)
        ::"eax","edx");
    return res;
}
int check_support_sse4_1(){
    int res=0;
    __asm__ __volatile__(
        "movl $1,%%eax\n\t"
        "cpuid\n\t"
        "test $0x80000,%%ecx\n\t"
        "jz 1f\n\t"
        "movl $1,%0\n\t"
        "1:\n\t"
        :"=m"(res)
        ::"eax","edx");
    return res;
}
int check_support_sse4_2(){
    int res=0;
    __asm__ __volatile__(
        "movl $1,%%eax\n\t"
        "cpuid\n\t"
        "test $0x0100000,%%ecx\n\t"
        "jz 1f\n\t"
        "movl $1,%0\n\t"
        "1:\n\t"
        :"=m"(res)
        ::"eax","edx");
    return res;
}
int main(){
    printf("MMX[%s]\n",check_support_mmx()?"OK":"FAILED");
    printf("SSE[%s]\n",check_support_sse()?"OK":"FAILED");
    printf("SSE2[%s]\n",check_support_sse2()?"OK":"FAILED");
    printf("SSE3[%s]\n",check_support_sse3()?"OK":"FAILED");
    printf("SSSE3[%s]\n",check_support_ssse3()?"OK":"FAILED");
    printf("SSE4.1[%s]\n",check_support_sse4_1()?"OK":"FAILED");
    printf("SSE4.2[%s]\n",check_support_sse4_2()?"OK":"FAILED");
    return 0;
}

#+END_SRC

** 基本概念
*** %mm寄存器
%mm寄存器是64bit,共有8个%mm寄存器.需要注意的是,%mm0-%mm7是X87 FPU寄存器的alias,
分别对应%r0-%r7.所以对%mm0-%mm7的操作会覆盖X87 FPU的内容.使用%mm寄存器的时候,
效果是这样的.
   1. TOS(Top Of Stack)会被置为0,也就是FPU registers的顶部会置0.
   2. 整个FPU tag word会被置为valid(0x0).如果后续想使用的话,需要使用EMMS指令.
   3. FPU register有80位,但是%mm寄存器只是用了64位,因此其余位填充(0xff).

因此如果在使用%mm寄存器之后,想使用FPU指令的话,那么应该
   1. fsave/fxsave保存FPU状态.
   2. 执行EMMS指令.
   3. 可选地使用frstore/fxstore载入之前FPU状态.
   3. 执行FPU指令.

如果使用FPU指令之后,想切换回%mm寄存器的话.
   1. fsave/fxsave保存FPU状态.
   2. 可选地使用frstore/fxrstore载入之前FPU状态.
   3. 操作%mm寄存器.

EMMS指令会清除MMX的状态,将FPU tag word进行清空,表示所有的FPU registers都已经清空.
我们必须在执行完成MMX指令之后,如果之后需要使用FPU registers的话,那么需要执行这个指令.

*** %xmm寄存器
%xmm寄存器是128bit.
Intel64架构下允许访问16个%xmm寄存器.
IA-32架构下只允许访问8个%xmm寄存器.

*** %mxcsr寄存器
%mxcsr是32bit.%mxcsr寄存器是在SSE指令集引入的,用来控制作用在%xmm寄存器操作的行为,
所有的这些行为都是和浮点相关的,在某种程度上非常类似于X87 FPU tag word.
关于%mxcsr寄存器各个位所表示的意思在这里不细说,可以查看Intel手册得到详细解释.
可以查看Intel Vol.1 10.2.3.%mxcrs默认值是0x1f80.

| 指令    | 说明              |
|---------+-------------------|
| LDMXCSR | mem->%mxcsr.32bit |
| STMXCSR | %mxcsr->mem.32bit |

*** Saturation & Wraparound
在进行整数运算的时候,可能会存在out-of-range的情况,结果不能够被目标数所表示.对于
这种溢出处理有下面3种方式.
   - Wraparound Arithmetic.
回绕模式.比如8个字节表示257的话,那么就是257-256=1.
   - Signed Saturation Arithmetic.
符号位溢出模式.比如8个字节表示257的话,那么会是0x7f=127.
   - Unsigned Saturation Arithmetic.
无符号溢出模式.比如8个字节表示257的话,那么会是0xff=255.

对于溢出模式对于一些计算是非常重要的.假设256色的像素如果两个像素相叠加的话,
当然不希望像素值发生回绕.如果溢出的话,通常这个像素保持纯黑或者是纯白.

*** General Purpose Register(GPR)
通用寄存器,包括EAX/RAX,EBX/RBX,ECX/RCX等.这些通用寄存器和%mm和%xmm之间的差别是,
%mm和%xmm不能够用来存放地址,也就是说不能够将内存地址存放在%mm和%xmm里面然后进行引用.

