simd.html

<div id="outline-container-orgheadline7" class="outline-3">
<h3 id="orgheadline7"><span class="section-number-3">1.7</span> 检测代码</h3>
<div class="outline-text-3" id="text-1-7">
<div class="org-src-container">

<pre class="src src-C++"><span class="org-comment-delimiter">/***************************************************************************</span>
<span class="org-comment"> *</span>
<span class="org-comment"> * Copyright (c) Baidu.com, Inc. All Rights Reserved</span>
<span class="org-comment"> *</span>
<span class="org-comment"> **************************************************************************/</span>


<span class="org-comment-delimiter">/**</span>
<span class="org-comment"> * @file   detect.c</span>
<span class="org-comment"> * @author zhangyan04(@baidu.com)</span>
<span class="org-comment"> * @brief</span>
<span class="org-comment"> *</span>
<span class="org-comment"> */</span>

<span class="org-preprocessor">#include</span> <span class="org-string">&lt;stdio.h&gt;</span>
<span class="org-type">int</span> <span class="org-function-name">check_support_mmx</span>(){
    <span class="org-type">int</span> <span class="org-variable-name">res</span>=0;
    <span class="org-keyword">__asm__</span> __volatile__(
        <span class="org-string">"movl $1,%%eax\n\t"</span>
        <span class="org-string">"cpuid\n\t"</span>
        <span class="org-string">"test $0x800000,%%edx\n\t"</span>
        <span class="org-string">"jz 1f\n\t"</span>
        <span class="org-string">"movl $1,%0\n\t"</span>
        <span class="org-string">"1:\n\t"</span>
        :<span class="org-string">"=m"</span>(res)
        ::<span class="org-string">"eax"</span>,<span class="org-string">"edx"</span>);
    <span class="org-keyword">return</span> res;
}
<span class="org-type">int</span> <span class="org-function-name">check_support_sse</span>(){
    <span class="org-type">int</span> <span class="org-variable-name">res</span>=0;
    <span class="org-keyword">__asm__</span> __volatile__(
        <span class="org-string">"movl $1,%%eax\n\t"</span>
        <span class="org-string">"cpuid\n\t"</span>
        <span class="org-string">"test $0x02000000,%%edx\n\t"</span>
        <span class="org-string">"jz 1f\n\t"</span>
        <span class="org-string">"movl $1,%0\n\t"</span>
        <span class="org-string">"1:\n\t"</span>
        :<span class="org-string">"=m"</span>(res)
        ::<span class="org-string">"eax"</span>,<span class="org-string">"edx"</span>);
    <span class="org-keyword">return</span> res;
}
<span class="org-type">int</span> <span class="org-function-name">check_support_sse2</span>(){
    <span class="org-type">int</span> <span class="org-variable-name">res</span>=0;
    <span class="org-keyword">__asm__</span> __volatile__(
        <span class="org-string">"movl $1,%%eax\n\t"</span>
        <span class="org-string">"cpuid\n\t"</span>
        <span class="org-string">"test $0x04000000,%%edx\n\t"</span>
        <span class="org-string">"jz 1f\n\t"</span>
        <span class="org-string">"movl $1,%0\n\t"</span>
        <span class="org-string">"1:\n\t"</span>
        :<span class="org-string">"=m"</span>(res)
        ::<span class="org-string">"eax"</span>,<span class="org-string">"edx"</span>);
    <span class="org-keyword">return</span> res;
}
<span class="org-type">int</span> <span class="org-function-name">check_support_sse3</span>(){
    <span class="org-type">int</span> <span class="org-variable-name">res</span>=0;
    <span class="org-keyword">__asm__</span> __volatile__(
        <span class="org-string">"movl $1,%%eax\n\t"</span>
        <span class="org-string">"cpuid\n\t"</span>
        <span class="org-string">"test $0x1,%%ecx\n\t"</span>
        <span class="org-string">"jz 1f\n\t"</span>
        <span class="org-string">"movl $1,%0\n\t"</span>
        <span class="org-string">"1:\n\t"</span>
        :<span class="org-string">"=m"</span>(res)
        ::<span class="org-string">"eax"</span>,<span class="org-string">"edx"</span>);
    <span class="org-keyword">return</span> res;
}
<span class="org-type">int</span> <span class="org-function-name">check_support_ssse3</span>(){
    <span class="org-type">int</span> <span class="org-variable-name">res</span>=0;
    <span class="org-keyword">__asm__</span> __volatile__(
        <span class="org-string">"movl $1,%%eax\n\t"</span>
        <span class="org-string">"cpuid\n\t"</span>
        <span class="org-string">"test $0x0200,%%ecx\n\t"</span>
        <span class="org-string">"jz 1f\n\t"</span>
        <span class="org-string">"movl $1,%0\n\t"</span>
        <span class="org-string">"1:\n\t"</span>
        :<span class="org-string">"=m"</span>(res)
        ::<span class="org-string">"eax"</span>,<span class="org-string">"edx"</span>);
    <span class="org-keyword">return</span> res;
}
<span class="org-type">int</span> <span class="org-function-name">check_support_sse4_1</span>(){
    <span class="org-type">int</span> <span class="org-variable-name">res</span>=0;
    <span class="org-keyword">__asm__</span> __volatile__(
        <span class="org-string">"movl $1,%%eax\n\t"</span>
        <span class="org-string">"cpuid\n\t"</span>
        <span class="org-string">"test $0x80000,%%ecx\n\t"</span>
        <span class="org-string">"jz 1f\n\t"</span>
        <span class="org-string">"movl $1,%0\n\t"</span>
        <span class="org-string">"1:\n\t"</span>
        :<span class="org-string">"=m"</span>(res)
        ::<span class="org-string">"eax"</span>,<span class="org-string">"edx"</span>);
    <span class="org-keyword">return</span> res;
}
<span class="org-type">int</span> <span class="org-function-name">check_support_sse4_2</span>(){
    <span class="org-type">int</span> <span class="org-variable-name">res</span>=0;
    <span class="org-keyword">__asm__</span> __volatile__(
        <span class="org-string">"movl $1,%%eax\n\t"</span>
        <span class="org-string">"cpuid\n\t"</span>
        <span class="org-string">"test $0x0100000,%%ecx\n\t"</span>
        <span class="org-string">"jz 1f\n\t"</span>
        <span class="org-string">"movl $1,%0\n\t"</span>
        <span class="org-string">"1:\n\t"</span>
        :<span class="org-string">"=m"</span>(res)
        ::<span class="org-string">"eax"</span>,<span class="org-string">"edx"</span>);
    <span class="org-keyword">return</span> res;
}
<span class="org-type">int</span> <span class="org-function-name">main</span>(){
    printf(<span class="org-string">"MMX[%s]\n"</span>,check_support_mmx()?<span class="org-string">"OK"</span>:<span class="org-string">"FAILED"</span>);
    printf(<span class="org-string">"SSE[%s]\n"</span>,check_support_sse()?<span class="org-string">"OK"</span>:<span class="org-string">"FAILED"</span>);
    printf(<span class="org-string">"SSE2[%s]\n"</span>,check_support_sse2()?<span class="org-string">"OK"</span>:<span class="org-string">"FAILED"</span>);
    printf(<span class="org-string">"SSE3[%s]\n"</span>,check_support_sse3()?<span class="org-string">"OK"</span>:<span class="org-string">"FAILED"</span>);
    printf(<span class="org-string">"SSSE3[%s]\n"</span>,check_support_ssse3()?<span class="org-string">"OK"</span>:<span class="org-string">"FAILED"</span>);
    printf(<span class="org-string">"SSE4.1[%s]\n"</span>,check_support_sse4_1()?<span class="org-string">"OK"</span>:<span class="org-string">"FAILED"</span>);
    printf(<span class="org-string">"SSE4.2[%s]\n"</span>,check_support_sse4_2()?<span class="org-string">"OK"</span>:<span class="org-string">"FAILED"</span>);
    <span class="org-keyword">return</span> 0;
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgheadline20" class="outline-2">
<h2 id="orgheadline20"><span class="section-number-2">2</span> 基本概念</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-orgheadline9" class="outline-3">
<h3 id="orgheadline9"><span class="section-number-3">2.1</span> %mm寄存器</h3>
<div class="outline-text-3" id="text-2-1">
<p>
%mm寄存器是64bit,共有8个%mm寄存器.需要注意的是,%mm0-%mm7是X87 FPU寄存器的alias,
分别对应%r0-%r7.所以对%mm0-%mm7的操作会覆盖X87 FPU的内容.使用%mm寄存器的时候,
效果是这样的.
</p>
<ol class="org-ol">
<li>TOS(Top Of Stack)会被置为0,也就是FPU registers的顶部会置0.</li>
<li>整个FPU tag word会被置为valid(0x0).如果后续想使用的话,需要使用EMMS指令.</li>
<li>FPU register有80位,但是%mm寄存器只是用了64位,因此其余位填充(0xff).</li>
</ol>

<p>
因此如果在使用%mm寄存器之后,想使用FPU指令的话,那么应该
</p>
<ol class="org-ol">
<li>fsave/fxsave保存FPU状态.</li>
<li>执行EMMS指令.</li>
<li>可选地使用frstore/fxstore载入之前FPU状态.</li>
<li>执行FPU指令.</li>
</ol>

<p>
如果使用FPU指令之后,想切换回%mm寄存器的话.
</p>
<ol class="org-ol">
<li>fsave/fxsave保存FPU状态.</li>
<li>可选地使用frstore/fxrstore载入之前FPU状态.</li>
<li>操作%mm寄存器.</li>
</ol>

<p>
EMMS指令会清除MMX的状态,将FPU tag word进行清空,表示所有的FPU registers都已经清空.
我们必须在执行完成MMX指令之后,如果之后需要使用FPU registers的话,那么需要执行这个指令.
</p>
</div>
</div>

<div id="outline-container-orgheadline10" class="outline-3">
<h3 id="orgheadline10"><span class="section-number-3">2.2</span> %xmm寄存器</h3>
<div class="outline-text-3" id="text-2-2">
<p>
%xmm寄存器是128bit.
Intel64架构下允许访问16个%xmm寄存器.
IA-32架构下只允许访问8个%xmm寄存器.
</p>
</div>
</div>

<div id="outline-container-orgheadline11" class="outline-3">
<h3 id="orgheadline11"><span class="section-number-3">2.3</span> %mxcsr寄存器</h3>
<div class="outline-text-3" id="text-2-3">
<p>
%mxcsr是32bit.%mxcsr寄存器是在SSE指令集引入的,用来控制作用在%xmm寄存器操作的行为,
所有的这些行为都是和浮点相关的,在某种程度上非常类似于X87 FPU tag word.
关于%mxcsr寄存器各个位所表示的意思在这里不细说,可以查看Intel手册得到详细解释.
可以查看Intel Vol.1 10.2.3.%mxcrs默认值是0x1f80.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">指令</th>
<th scope="col" class="org-left">说明</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">LDMXCSR</td>
<td class="org-left">mem-&gt;%mxcsr.32bit</td>
</tr>

<tr>
<td class="org-left">STMXCSR</td>
<td class="org-left">%mxcsr-&gt;mem.32bit</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgheadline12" class="outline-3">
<h3 id="orgheadline12"><span class="section-number-3">2.4</span> Saturation &amp; Wraparound</h3>
<div class="outline-text-3" id="text-2-4">
<p>
在进行整数运算的时候,可能会存在out-of-range的情况,结果不能够被目标数所表示.对于
这种溢出处理有下面3种方式.
</p>
<ul class="org-ul">
<li>Wraparound Arithmetic.</li>
</ul>
<p>
回绕模式.比如8个字节表示257的话,那么就是257-256=1.
</p>
<ul class="org-ul">
<li>Signed Saturation Arithmetic.</li>
</ul>
<p>
符号位溢出模式.比如8个字节表示257的话,那么会是0x7f=127.
</p>
<ul class="org-ul">
<li>Unsigned Saturation Arithmetic.</li>
</ul>
<p>
无符号溢出模式.比如8个字节表示257的话,那么会是0xff=255.
</p>

<p>
对于溢出模式对于一些计算是非常重要的.假设256色的像素如果两个像素相叠加的话,
当然不希望像素值发生回绕.如果溢出的话,通常这个像素保持纯黑或者是纯白.
</p>
</div>
</div>

<div id="outline-container-orgheadline13" class="outline-3">
<h3 id="orgheadline13"><span class="section-number-3">2.5</span> General Purpose Register(GPR)</h3>
<div class="outline-text-3" id="text-2-5">
<p>
通用寄存器,包括EAX/RAX,EBX/RBX,ECX/RCX等.这些通用寄存器和%mm和%xmm之间的差别是,
%mm和%xmm不能够用来存放地址,也就是说不能够将内存地址存放在%mm和%xmm里面然后进行引用.
</p>
</div>
</div>
