simd.html

<div id="outline-container-orgheadline14" class="outline-3">
<h3 id="orgheadline14"><span class="section-number-3">2.6</span> X87 FPU</h3>
<div class="outline-text-3" id="text-2-6">
<p>
X87 FPU是浮点运算部件,共有8个寄存器,组织方式是堆栈.通常来说对于SIMD并不需要关心
X87 FPU这个部件.但是因为SIMD使用的%mm寄存器是FPU寄存器的alias,所以我们这里需要了解.
后面我们把X87 FPU都称为FPU.
</p>

<p>
对于FPU会有一个状态,状态包括执行环境和寄存器内容.每个寄存器80bit.在操作%mm寄存器
和执行FPU指令切换之间,我们可能需要保存状态.那么下面就是关于FPU操作状态的指令.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">指令</th>
<th scope="col" class="org-left">说明</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">FSAVE</td>
<td class="org-left">保存FPU状态,然后重新初始化FPU.84/108字节</td>
</tr>

<tr>
<td class="org-left">FRSTORE</td>
<td class="org-left">FSAVE逆操作.</td>
</tr>

<tr>
<td class="org-left">FXSAVE</td>
<td class="org-left">保存FPU状态/%mm寄存器,%xmm寄存器,%mxscr寄存器.512字节.</td>
</tr>

<tr>
<td class="org-left">FXRSTORE</td>
<td class="org-left">FXSAVE逆操作.</td>
</tr>
</tbody>
</table>

<p>
关于如何协调%mm寄存器和FPU寄存器的使用,在%mm寄存器这节有解释.
</p>
</div>
</div>

<div id="outline-container-orgheadline15" class="outline-3">
<h3 id="orgheadline15"><span class="section-number-3">2.7</span> Packed &amp; Scalar Instructions</h3>
<div class="outline-text-3" id="text-2-7">
<p>
对于SIMD提供了操作packed和scalar指令.我们假设存在两个操作数,
假设是(f00,f01,f02,f03)和(f10,f11,f12,f13)的话,那么
</p>
<ul class="org-ul">
<li>如果是packed操作的话,那么操作是(f00 op f01,f01 op f11,f02 op f12,f03 op f13).</li>
<li>如果是scalar操作的话,那么操作是(f00,f01,f03,f03 op f13).</li>
</ul>
<p>
也就是说,如果在scalar操作的话,仅仅是操作最后面一个单元,其他单元全部复制.
</p>

<p>
需要注意的是,在Scalar操作下面
</p>
<ul class="org-ul">
<li>单精度浮点是24-bit significand + 8-bit exponent.</li>
<li>双精度浮点是53-bit significand + 11-bit exponent.</li>
</ul>
<p>
而在IEEE-754和FPU操作环境下面的的话
</p>
<ul class="org-ul">
<li>单精度浮点是24-bit significand + 15-bit exponent.</li>
<li>双精度浮点是52-bit significand + 15-bit exponent.</li>
</ul>
<p>
此外SIMD操作浮点数和FPU操作浮点数有些不同,SIMD是直接操作浮点数的Native Format,
而FPU是首先在更高的精度上面操作,然后取舍到Native Format.
</p>
</div>
</div>

<div id="outline-container-orgheadline16" class="outline-3">
<h3 id="orgheadline16"><span class="section-number-3">2.8</span> Temporal &amp; NonTemporal Data</h3>
<div class="outline-text-3" id="text-2-8">
<p>
待续.需要阅读Intel Vol.3A Memory &amp; Cache Control这节.在Intel Vol.1 10.4.6.2也有介绍.
</p>
</div>
</div>

<div id="outline-container-orgheadline17" class="outline-3">
<h3 id="orgheadline17"><span class="section-number-3">2.9</span> Alignment</h3>
<div class="outline-text-3" id="text-2-9">
<p>
关于对齐方面,如果使用128bit Memory Operand必须进行16字节的对齐.但是有些例外
</p>
<ul class="org-ul">
<li>使用UnAlign的Data Transfer操作,比如MOVUPS/MOVUPD.</li>
<li>如果是Scalar Memory Float的话,必须是4字节对齐.</li>
<li>如果是Scalar Memory Double的话,必须是8字节对齐.</li>
<li>此外还有部分指令字节对齐存在例外,会在响应的指令部分说明.</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline18" class="outline-3">
<h3 id="orgheadline18"><span class="section-number-3">2.10</span> Asymmetric &amp; Horizontal Processing</h3>
<div class="outline-text-3" id="text-2-10">
<p>
分别是对称处理和水平处理.假设存在操作数(a0,a1,a2,a3)以及(b0,b1,b2,b3).
对于大部分SIMD指令处理都是对称处理,也就是(a0 op b0,a1 op b1,a2 op b2,a3 op b3).
相邻处理就是(a0 op a1,a2 op a3,b0 op b1,b2 op b3).
</p>
</div>
</div>

<div id="outline-container-orgheadline19" class="outline-3">
<h3 id="orgheadline19"><span class="section-number-3">2.11</span> Zero Fill &amp; Truncated</h3>
<div class="outline-text-3" id="text-2-11">
<p>
对于从内存/寄存器载入到寄存器的话,如果位数不够,通常是占用寄存器的低字节,
除非显式指定.对于寄存器中没有使用的高字节,通常是采用0填充,也就是Zero Fill.:).
</p>

<p>
而另外一个方面,如果从寄存器传输到内存/寄存器,如果寄存器位数过多的话,那么也
通常只是传输寄存器的低字节,而保留寄存器的高字节,也就是Truncated.:).
</p>
</div>
</div>
</div>
