src/simd.org
** 指令
为了方便表示,我们定义下面缩写和操作.

| 助记符 | 含义                                          | 其他 |
|--------+-----------------------------------------------+------|
| A      | Aligned                                       |      |
| U      | UnAligned                                     |      |
| L      | Low                                           |      |
| H      | High/Horizontal                               |      |
| B      | Byte                                          |      |
| SB     | Signed Byte                                   |      |
| UB     | Unsigned Byte                                 |      |
| W      | Word                                          |      |
| SW     | Signed Word                                   |      |
| UW     | Unsigned Word                                 |      |
| Q      | Quad Word                                     |      |
| DQ     | Double Quad Word                              |      |
| F      | Float                                         |      |
| D      | Double                                        |      |
| PS     | Packed Single Precision Floating Point        |      |
| SS     | Scalar Single Precision Floating Point        |      |
| PD     | Packed Double Precision Floating Point        |      |
| SD     | Scalar Double Precision Floating Point        |      |
| CMP    | Compare                                       |      |
| STR    | String                                        |      |
| EQ     | Equal                                         |      |
| GT     | Greater                                       |      |
| SLL    | Shift Left Logical                            |      |
| SRL    | Shift Right Logical                           |      |
| SRA    | Shift Right Arithmetic                        |      |
| DUP    | Duplicate                                     |      |
| WAM    | Wraparound Mode                               |      |
| SSM    | Signed Saturation Mode                        |      |
| USM    | Unsigned Saturation Mode                      |      |
| RCP    | Reciprocal.RCP(x)=1/x                         |      |
| SQRT   | Square Root                                   |      |
| RSQRT  | Reciprocal Square Root                        |      |
| MSK    | Mask                                          |      |
| CVT    | Convert                                       |      |
| SX     | Signed Extend                                 |      |
| ZX     | Zero Extend                                   |      |
| ROUND  |                                               |      |
| UNPCK  | Unpack                                        |      |
| EXTR   | Extract                                       |      |
| INSR   | Insert                                        |      |
| AND    | a && b                                        |      |
| OR     | a or b                                        |      |
| NAND   | !(a && b)                                     |      |
| XOR    | a ^ b                                         |      |
| SAD    | Sum of Absolute Difference.                   |      |
| SIGN   | SIGN(src,dst)=if(src<0):dst=-dst              |      |
| MADD   | MADD((a00,a01),(b00,b01))=(a00*b00)+(a01*b01) |      |
| ALIGNR | ALIGNR(src,dst,imm)=(src,dst) >> imm          |      |
| AVG    | Average                                       |      |
| ABS    | Absolute                                      |      |
| NT     | NonTemporal                                   |      |
| CVTT   | Convert With Truncate                         |      |
| UNPCKH | UNPCKH((s00,s01),(d00,d01))=(d01,s01)         |      |
| UNPCKL | UNPCKL((s00,s01),(d00,d01))=(d00,s00)         |      |
| MSB    | Most Significant Bit                          |      |
| LF     | Lowest Float                                  |      |
| LF2    | Lower 2 Floats                                |      |
| LF4    | Lower 4 Floats                                |      |
| HF     | Highest Float                                 |      |
| HF2    | Higher 2 Floats                               |      |
| LD     | Lowest Double                                 |      |
| HD     | Highest Double                                |      |
| LDW    | Lower Double Word                             |      |
| LDW2   | Lower 2 Double Words                          |      |
| LDW4   | Lower 4 Double Words                          |      |
| LW     | Lower Word                                    |      |
| HW     | Higher Wword                                  |      |
| GPR    | General Purpose Resgister                     |      |

这里有几点需要注意的
   - 对于Move如果使用了错误类型指令的话,会产生性能消耗.Vol.1 11.6.9
   - 对于使用SIMD来说,推荐使用caller-save.Vol.1 11.6.10.3

*** Data Transfer Instructions
**** Move Mask Instructions
对于每一个data element的MSB移到GRP.这些指令通常用于分支判定.
| 指令     | 说明 |
|----------+------|
| PMOVMSKB |      |
| MOVMSKPS |      |
| MOVMSKPD |      |

**** Move Integer Instructions
| 指令   | 说明             |
|--------+------------------|
| MOVD   |                  |
| MOVQ   |                  |
| MOVDQA |                  |
| MOVDQU |                  |
| LDDQU  | 功能和MOVDQU相同 |

关于LDDQU和MOVDQU的差别,可以参看Intel关于LDDQU指令描述,主要还是在某些场景
下面的性能差别,功能上没有任何区别.

