simd.html

<div id="outline-container-orgheadline56" class="outline-2">
<h2 id="orgheadline56"><span class="section-number-2">3</span> 指令</h2>
<div class="outline-text-2" id="text-3">
<p>
为了方便表示,我们定义下面缩写和操作.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">助记符</th>
<th scope="col" class="org-left">含义</th>
<th scope="col" class="org-left">其他</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">A</td>
<td class="org-left">Aligned</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">U</td>
<td class="org-left">UnAligned</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">L</td>
<td class="org-left">Low</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">H</td>
<td class="org-left">High/Horizontal</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">B</td>
<td class="org-left">Byte</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">SB</td>
<td class="org-left">Signed Byte</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">UB</td>
<td class="org-left">Unsigned Byte</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">W</td>
<td class="org-left">Word</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">SW</td>
<td class="org-left">Signed Word</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">UW</td>
<td class="org-left">Unsigned Word</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Q</td>
<td class="org-left">Quad Word</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">DQ</td>
<td class="org-left">Double Quad Word</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">F</td>
<td class="org-left">Float</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">D</td>
<td class="org-left">Double</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">PS</td>
<td class="org-left">Packed Single Precision Floating Point</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">SS</td>
<td class="org-left">Scalar Single Precision Floating Point</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">PD</td>
<td class="org-left">Packed Double Precision Floating Point</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">SD</td>
<td class="org-left">Scalar Double Precision Floating Point</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">CMP</td>
<td class="org-left">Compare</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">STR</td>
<td class="org-left">String</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">EQ</td>
<td class="org-left">Equal</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">GT</td>
<td class="org-left">Greater</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">SLL</td>
<td class="org-left">Shift Left Logical</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">SRL</td>
<td class="org-left">Shift Right Logical</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">SRA</td>
<td class="org-left">Shift Right Arithmetic</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">DUP</td>
<td class="org-left">Duplicate</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">WAM</td>
<td class="org-left">Wraparound Mode</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">SSM</td>
<td class="org-left">Signed Saturation Mode</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">USM</td>
<td class="org-left">Unsigned Saturation Mode</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">RCP</td>
<td class="org-left">Reciprocal.RCP(x)=1/x</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">SQRT</td>
<td class="org-left">Square Root</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">RSQRT</td>
<td class="org-left">Reciprocal Square Root</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">MSK</td>
<td class="org-left">Mask</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">CVT</td>
<td class="org-left">Convert</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">SX</td>
<td class="org-left">Signed Extend</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">ZX</td>
<td class="org-left">Zero Extend</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">ROUND</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">UNPCK</td>
<td class="org-left">Unpack</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">EXTR</td>
<td class="org-left">Extract</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">INSR</td>
<td class="org-left">Insert</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">AND</td>
<td class="org-left">a &amp;&amp; b</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">OR</td>
<td class="org-left">a or b</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">NAND</td>
<td class="org-left">!(a &amp;&amp; b)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">XOR</td>
<td class="org-left">a ^ b</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">SAD</td>
<td class="org-left">Sum of Absolute Difference.</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">SIGN</td>
<td class="org-left">SIGN(src,dst)=if(src&lt;0):dst=-dst</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">MADD</td>
<td class="org-left">MADD((a00,a01),(b00,b01))=(a00*b00)+(a01*b01)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">ALIGNR</td>
<td class="org-left">ALIGNR(src,dst,imm)=(src,dst) &gt;&gt; imm</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">AVG</td>
<td class="org-left">Average</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">ABS</td>
<td class="org-left">Absolute</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">NT</td>
<td class="org-left">NonTemporal</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">CVTT</td>
<td class="org-left">Convert With Truncate</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">UNPCKH</td>
<td class="org-left">UNPCKH((s00,s01),(d00,d01))=(d01,s01)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">UNPCKL</td>
<td class="org-left">UNPCKL((s00,s01),(d00,d01))=(d00,s00)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">MSB</td>
<td class="org-left">Most Significant Bit</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">LF</td>
<td class="org-left">Lowest Float</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">LF2</td>
<td class="org-left">Lower 2 Floats</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">LF4</td>
<td class="org-left">Lower 4 Floats</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">HF</td>
<td class="org-left">Highest Float</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">HF2</td>
<td class="org-left">Higher 2 Floats</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">LD</td>
<td class="org-left">Lowest Double</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">HD</td>
<td class="org-left">Highest Double</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">LDW</td>
<td class="org-left">Lower Double Word</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">LDW2</td>
<td class="org-left">Lower 2 Double Words</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">LDW4</td>
<td class="org-left">Lower 4 Double Words</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">LW</td>
<td class="org-left">Lower Word</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">HW</td>
<td class="org-left">Higher Wword</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">GPR</td>
<td class="org-left">General Purpose Resgister</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>

<p>
这里有几点需要注意的
</p>
<ul class="org-ul">
<li>对于Move如果使用了错误类型指令的话,会产生性能消耗.Vol.1 11.6.9</li>
<li>对于使用SIMD来说,推荐使用caller-save.Vol.1 11.6.10.3</li>
</ul>
</div>

<div id="outline-container-orgheadline27" class="outline-3">
<h3 id="orgheadline27"><span class="section-number-3">3.1</span> Data Transfer Instructions</h3>
<div class="outline-text-3" id="text-3-1">
</div><div id="outline-container-orgheadline21" class="outline-4">
<h4 id="orgheadline21"><span class="section-number-4">3.1.1</span> Move Mask Instructions</h4>
<div class="outline-text-4" id="text-3-1-1">
<p>
对于每一个data element的MSB移到GRP.这些指令通常用于分支判定.
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">指令</th>
<th scope="col" class="org-left">说明</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">PMOVMSKB</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">MOVMSKPS</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">MOVMSKPD</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgheadline22" class="outline-4">
<h4 id="orgheadline22"><span class="section-number-4">3.1.2</span> Move Integer Instructions</h4>
<div class="outline-text-4" id="text-3-1-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">指令</th>
<th scope="col" class="org-left">说明</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">MOVD</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">MOVQ</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">MOVDQA</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">MOVDQU</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">LDDQU</td>
<td class="org-left">功能和MOVDQU相同</td>
</tr>
</tbody>
</table>

<p>
关于LDDQU和MOVDQU的差别,可以参看Intel关于LDDQU指令描述,主要还是在某些场景
下面的性能差别,功能上没有任何区别.
</p>
</div>
</div>
