src/simd.org
**** Move Float Instructions
| 指令    | 说明                   |
|---------+------------------------|
| MOVAPS  |                        |
| MOVUPS  |                        |
| MOVSS   |                        |
| MOVLPS  | 2PS<->LF2(%xmm)        |
| MOVHPS  | 2PS<->HF2(%xmm)        |
| MOVLHPS | LF2(%xmm1)->HF2(%xmm2) |
| MOVHLPS | HF2(%xmm1)->LF2(%xmm1) |

**** Move Double Instructions
| 指令   | 说明          |
|--------+---------------|
| MOVAPD |               |
| MOVUPD |               |
| MOVSD  |               |
| MOVLPD | PD<->LD(%xmm) |
| MOVHPD | PD<->HD(%xmm) |

**** Move Duplication Instructions
| 指令     | 说明                         |
|----------+------------------------------|
| MOVDDUP  | (d0,d1)->(d0,d0)             |
| MOVSHDUP | (f0,f1,f2,f3)->(f1,f1,f3,f3) |
| MOVSLDUP | (f0,f1,f2,f3)->(f0,f0,f2,f2) |

**** Move NonTemporal Instructions
| 指令       | 说明   |
|------------+--------|
| MOVNTI     |        |
| MOVNTQ     |        |
| MOVNTDQ    |        |
| MOVNTDQA   |        |
| MOVNTPS    |        |
| MOVNTPD    |        |
| MASKMOVQ   | @@TODO |
| MASKMOVDQU | @@TODO |

*** Arithmetic Instructions
**** ADD Instructions
***** 对称处理
| 指令    | 说明 |
|---------+------|
| PADDB   | WAM  |
| PADDW   | WAM  |
| PADDD   | WAM  |
| PADDQ   | WAM  |
| PADDSB  | SSM  |
| PADDSW  | SSM  |
| PADDUSB | USM  |
| PADDUSW | USM  |
| ADDPS   |      |
| ADDSS   |      |
| ADDPD   |      |
| ADDSD   |      |

***** 水平处理
| 指令    | 说明 |
|---------+------|
| PHADDW  |      |
| PHADDSW | SSM  |
| PHADDD  |      |
| HADDPS  |      |
| HADDPD  |      |

**** SUB Instructions
***** 对称处理
| 指令    | 说明 |
|---------+------|
| PSUBB   | WAM  |
| PSUBW   | WAM  |
| PSUBD   | WAM  |
| PSUBQ   | WAM  |
| PSUBSB  | SSM  |
| PSUBSW  | SSM  |
| PSUBSD  | SSM  |
| PSUBUSB | USM  |
| PSUBUSW | USM  |
| SUBPS   |      |
| SUBSS   |      |
| SUBPD   |      |
| SUBSD   |      |

***** 水平处理
| 指令    | 说明 |
|---------+------|
| PHSUBW  |      |
| PHSUBSW | SSM  |
| PHSUBD  |      |
| HSUBPS  |      |
| HSUBPD  |      |

**** MUL Instructions
| 指令    | 说明                                                              |
|---------+-------------------------------------------------------------------|
| PMULLW  | (w00,w01,..),(w10,w11,..)->(LW(w00*w10),LW(w01*w11),..)           |
| PMULHW  | (w00,w01,..),(w10,w11,..)->(HW(w00*w10),HW(w01*w11),..)           |
| PMULHUW | 同上,Unsigned方式.                                                |
| PMULLD  | (dw00,dw01,..),(dw10,dw11,..)->(LDW(dw00*dw10),LDW(dw01*dw11),..) |
| PMULDQ  | (dw00,dw01,..),(dw10,dw11,..)->(dw00*dw10,dw01*dw11,..)           |
| PMULUDQ | 同上,Unsigned方式.                                                |
| MULPS   |                                                                   |
| MULSS   |                                                                   |
| MULPD   |                                                                   |
| MULSD   |                                                                   |

**** DIV Instructions
| 指令  | 说明 |
|-------+------|
| DIVPS |      |
| DIVSS |      |
| DIVPD |      |
| DIVSD |      |

**** M?X Instructions
