simd.html

<div id="outline-container-orgheadline23" class="outline-4">
<h4 id="orgheadline23"><span class="section-number-4">3.1.3</span> Move Float Instructions</h4>
<div class="outline-text-4" id="text-3-1-3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">指令</th>
<th scope="col" class="org-left">说明</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">MOVAPS</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">MOVUPS</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">MOVSS</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">MOVLPS</td>
<td class="org-left">2PS&lt;-&gt;LF2(%xmm)</td>
</tr>

<tr>
<td class="org-left">MOVHPS</td>
<td class="org-left">2PS&lt;-&gt;HF2(%xmm)</td>
</tr>

<tr>
<td class="org-left">MOVLHPS</td>
<td class="org-left">LF2(%xmm1)-&gt;HF2(%xmm2)</td>
</tr>

<tr>
<td class="org-left">MOVHLPS</td>
<td class="org-left">HF2(%xmm1)-&gt;LF2(%xmm1)</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgheadline24" class="outline-4">
<h4 id="orgheadline24"><span class="section-number-4">3.1.4</span> Move Double Instructions</h4>
<div class="outline-text-4" id="text-3-1-4">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">指令</th>
<th scope="col" class="org-left">说明</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">MOVAPD</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">MOVUPD</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">MOVSD</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">MOVLPD</td>
<td class="org-left">PD&lt;-&gt;LD(%xmm)</td>
</tr>

<tr>
<td class="org-left">MOVHPD</td>
<td class="org-left">PD&lt;-&gt;HD(%xmm)</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgheadline25" class="outline-4">
<h4 id="orgheadline25"><span class="section-number-4">3.1.5</span> Move Duplication Instructions</h4>
<div class="outline-text-4" id="text-3-1-5">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">指令</th>
<th scope="col" class="org-left">说明</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">MOVDDUP</td>
<td class="org-left">(d0,d1)-&gt;(d0,d0)</td>
</tr>

<tr>
<td class="org-left">MOVSHDUP</td>
<td class="org-left">(f0,f1,f2,f3)-&gt;(f1,f1,f3,f3)</td>
</tr>

<tr>
<td class="org-left">MOVSLDUP</td>
<td class="org-left">(f0,f1,f2,f3)-&gt;(f0,f0,f2,f2)</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgheadline26" class="outline-4">
<h4 id="orgheadline26"><span class="section-number-4">3.1.6</span> Move NonTemporal Instructions</h4>
<div class="outline-text-4" id="text-3-1-6">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">指令</th>
<th scope="col" class="org-left">说明</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">MOVNTI</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">MOVNTQ</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">MOVNTDQ</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">MOVNTDQA</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">MOVNTPS</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">MOVNTPD</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">MASKMOVQ</td>
<td class="org-left">@@TODO</td>
</tr>

<tr>
<td class="org-left">MASKMOVDQU</td>
<td class="org-left">@@TODO</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>

<div id="outline-container-orgheadline40" class="outline-3">
<h3 id="orgheadline40"><span class="section-number-3">3.2</span> Arithmetic Instructions</h3>
<div class="outline-text-3" id="text-3-2">
</div><div id="outline-container-orgheadline30" class="outline-4">
<h4 id="orgheadline30"><span class="section-number-4">3.2.1</span> ADD Instructions</h4>
<div class="outline-text-4" id="text-3-2-1">
</div><ol class="org-ol"><li><a id="orgheadline28"></a>对称处理<br  /><div class="outline-text-5" id="text-3-2-1-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">指令</th>
<th scope="col" class="org-left">说明</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">PADDB</td>
<td class="org-left">WAM</td>
</tr>

<tr>
<td class="org-left">PADDW</td>
<td class="org-left">WAM</td>
</tr>

<tr>
<td class="org-left">PADDD</td>
<td class="org-left">WAM</td>
</tr>

<tr>
<td class="org-left">PADDQ</td>
<td class="org-left">WAM</td>
</tr>

<tr>
<td class="org-left">PADDSB</td>
<td class="org-left">SSM</td>
</tr>

<tr>
<td class="org-left">PADDSW</td>
<td class="org-left">SSM</td>
</tr>

<tr>
<td class="org-left">PADDUSB</td>
<td class="org-left">USM</td>
</tr>

<tr>
<td class="org-left">PADDUSW</td>
<td class="org-left">USM</td>
</tr>

<tr>
<td class="org-left">ADDPS</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">ADDSS</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">ADDPD</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">ADDSD</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div></li>

<li><a id="orgheadline29"></a>水平处理<br  /><div class="outline-text-5" id="text-3-2-1-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">指令</th>
<th scope="col" class="org-left">说明</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">PHADDW</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">PHADDSW</td>
<td class="org-left">SSM</td>
</tr>

<tr>
<td class="org-left">PHADDD</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">HADDPS</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">HADDPD</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div></li></ol>
</div>

<div id="outline-container-orgheadline33" class="outline-4">
<h4 id="orgheadline33"><span class="section-number-4">3.2.2</span> SUB Instructions</h4>
<div class="outline-text-4" id="text-3-2-2">
</div><ol class="org-ol"><li><a id="orgheadline31"></a>对称处理<br  /><div class="outline-text-5" id="text-3-2-2-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">指令</th>
<th scope="col" class="org-left">说明</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">PSUBB</td>
<td class="org-left">WAM</td>
</tr>

<tr>
<td class="org-left">PSUBW</td>
<td class="org-left">WAM</td>
</tr>

<tr>
<td class="org-left">PSUBD</td>
<td class="org-left">WAM</td>
</tr>

<tr>
<td class="org-left">PSUBQ</td>
<td class="org-left">WAM</td>
</tr>

<tr>
<td class="org-left">PSUBSB</td>
<td class="org-left">SSM</td>
</tr>

<tr>
<td class="org-left">PSUBSW</td>
<td class="org-left">SSM</td>
</tr>

<tr>
<td class="org-left">PSUBSD</td>
<td class="org-left">SSM</td>
</tr>

<tr>
<td class="org-left">PSUBUSB</td>
<td class="org-left">USM</td>
</tr>

<tr>
<td class="org-left">PSUBUSW</td>
<td class="org-left">USM</td>
</tr>

<tr>
<td class="org-left">SUBPS</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">SUBSS</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">SUBPD</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">SUBSD</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div></li>

<li><a id="orgheadline32"></a>水平处理<br  /><div class="outline-text-5" id="text-3-2-2-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">指令</th>
<th scope="col" class="org-left">说明</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">PHSUBW</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">PHSUBSW</td>
<td class="org-left">SSM</td>
</tr>

<tr>
<td class="org-left">PHSUBD</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">HSUBPS</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">HSUBPD</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div></li></ol>
</div>

<div id="outline-container-orgheadline34" class="outline-4">
<h4 id="orgheadline34"><span class="section-number-4">3.2.3</span> MUL Instructions</h4>
<div class="outline-text-4" id="text-3-2-3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">指令</th>
<th scope="col" class="org-left">说明</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">PMULLW</td>
<td class="org-left">(w00,w01,..),(w10,w11,..)-&gt;(LW(w00*w10),LW(w01*w11),..)</td>
</tr>

<tr>
<td class="org-left">PMULHW</td>
<td class="org-left">(w00,w01,..),(w10,w11,..)-&gt;(HW(w00*w10),HW(w01*w11),..)</td>
</tr>

<tr>
<td class="org-left">PMULHUW</td>
<td class="org-left">同上,Unsigned方式.</td>
</tr>

<tr>
<td class="org-left">PMULLD</td>
<td class="org-left">(dw00,dw01,..),(dw10,dw11,..)-&gt;(LDW(dw00*dw10),LDW(dw01*dw11),..)</td>
</tr>

<tr>
<td class="org-left">PMULDQ</td>
<td class="org-left">(dw00,dw01,..),(dw10,dw11,..)-&gt;(dw00*dw10,dw01*dw11,..)</td>
</tr>

<tr>
<td class="org-left">PMULUDQ</td>
<td class="org-left">同上,Unsigned方式.</td>
</tr>

<tr>
<td class="org-left">MULPS</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">MULSS</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">MULPD</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">MULSD</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgheadline35" class="outline-4">
<h4 id="orgheadline35"><span class="section-number-4">3.2.4</span> DIV Instructions</h4>
<div class="outline-text-4" id="text-3-2-4">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">指令</th>
<th scope="col" class="org-left">说明</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">DIVPS</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">DIVSS</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">DIVPD</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">DIVSD</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgheadline38" class="outline-4">
<h4 id="orgheadline38"><span class="section-number-4">3.2.5</span> M?X Instructions</h4>
<div class="outline-text-4" id="text-3-2-5">
</div><ol class="org-ol"><li><a id="orgheadline36"></a>MAX<br  /><div class="outline-text-5" id="text-3-2-5-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">指令</th>
<th scope="col" class="org-left">说明</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">PMAXSB</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">PMAXSW</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">PMAXSD</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">PMAXUB</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">PMAXUW</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">PMAXUD</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">MAXPS</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">MAXSS</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">MAXPD</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">MAXSD</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div></li>
