src/simd.org
***** MAX
| 指令   | 说明 |
|--------+------|
| PMAXSB |      |
| PMAXSW |      |
| PMAXSD |      |
| PMAXUB |      |
| PMAXUW |      |
| PMAXUD |      |
| MAXPS  |      |
| MAXSS  |      |
| MAXPD  |      |
| MAXSD  |      |

***** MIN
| 指令       | 说明 |
|------------+------|
| PMINSB     |      |
| PMINSW     |      |
| PMINSD     |      |
| PMINUB     |      |
| PMINUW     |      |
| PMINUD     |      |
| MINPS      |      |
| MINSS      |      |
| MINPD      |      |
| MINSD      |      |
| PHMINPOSUW |      |

PHMINPOSUW可以按照Unsigned Word来水平搜索最小值的位置.

**** Math Instructions
| 指令      | 说明                                            |
|-----------+-------------------------------------------------|
| PABSB     |                                                 |
| PABSW     |                                                 |
| PABSD     |                                                 |
| PAVGB     |                                                 |
| PAVGW     |                                                 |
| PSIGNB    |                                                 |
| PSIGNW    |                                                 |
| PSIGND    |                                                 |
| PMADDUBSW | UB->W.SSM                                       |
| PMADDWD   | W->DW                                           |
| PALIGNR   |                                                 |
| PMULHRSW  | @@TODO                                          |
| PSADBW    |                                                 |
| MPSADBW   | @@TODO                                          |
| DPPS      |                                                 |
| DPPD      |                                                 |
| ADDSUBPS  | (f00,f01,..),(f10,f11,..)->(f00-f10,f01+f11,..) |
| ADDSUBPD  | (d00,d01,..),(d10,d11,..)->(d00-d10,d01+d11,..) |
| RCPPS     |                                                 |
| RCPSS     |                                                 |
| RSQRTPS   |                                                 |
| RSQRTSS   |                                                 |
| SQRTPS    |                                                 |
| SQRTSS    |                                                 |
| SQRTSD    |                                                 |

*** Comparison Instructions
需要注意的是,如果没有特殊说明,比较结果是直接存放在结果数里面的,
不会影响EFLAGS这个寄存器内容.如果比较结果影响了EFLAGS寄存器的话,
那么会使用%EFLAGS来标记.

如果每个比较结果是符合预期的话,
那么目的数对应位数会置0xff,否则会置0x0.

对于CMP的指令,会使用立即数来决定具体使用什么比较方式.关于立即数对应
什么比较方式,可以查看具体指令里面的说明,比如CMPPS,CMPSS,CMPPD,CMPSD.

| 指令    | 说明    |
|---------+---------|
| PCMPEQB |         |
| PCMPEQW |         |
| PCMPEQD |         |
| PCMPEQQ |         |
| PCMPGTB |         |
| PCMPGTW |         |
| PCMPGTD |         |
| PCMPGTQ |         |
| CMPPS   |         |
| CMPSS   |         |
| CMPPD   |         |
| CMPSD   |         |
| COMISS  | %EFLAGS |
| UCOMISS | %EFLAGS |
| COMISD  | %EFLAGS |
| UCOMISD | %EFLAGS |
| PTEST   |         |

*** Conversion Instructions
对于涉及到浮点数的精度取舍问题,使用%mxccsr寄存器来判断.

如果精度取舍是采用截断方式来进行处理的话,那么指令前缀通常是CVTT.

| 指令      | 说明 |
|-----------+------|
| PACKSSWB  | SSM  |
| PACKSSDW  | SSM  |
| PACKUSDW  | USM  |

| 指令      | 说明 |
|-----------+------|
| CVTPS2PD  |      |
| CVTPD2PS  |      |
| CVTSS2SD  |      |
| CVTSD2SS  |      |
| CVTPI2PS  |      |
| CVTPS2PI  |      |
| CVTTPS2PI |      |
| CVTSI2SS  |      |
| CVTSS2SI  |      |
| CVTTSS2SI |      |
| CVTPI2PD  |      |
| CVTPD2PI  |      |
| CVTTPD2PI |      |
| CVTSI2SD  |      |
| CVTSD2SI  |      |
| CVTTSD2SI |      |
| CVTDQ2PS  |      |
| CVTPS2DQ  |      |
| CVTTPS2DQ |      |
| CVTDQ2PD  |      |
| CVTPD2DQ  |      |
| CVTTPD2DQ |      |


| 指令     | 说明 |
|----------+------|
| MOVQ2DQ  |      |
| MOVDQ2Q  |      |
| PMOVSXBW |      |
| PMOVZXBW |      |
| PMOVSXBD |      |
| PMOVZXBD |      |
| PMOVSXWD |      |
| PMOVZXWD |      |
| PMOVSXBQ |      |
| PMOVZXBQ |      |
| PMOVSXWQ |      |
| PMOVZXWQ |      |
| PMOVSXDQ |      |
| PMOVZXDQ |      |

| 指令    | 说明 |
|---------+------|
| ROUNDPS |      |
| ROUNDPD |      |
| ROUNDSS |      |
| ROUNDSD |      |

