simd.html

<li><a id="orgheadline37"></a>MIN<br  /><div class="outline-text-5" id="text-3-2-5-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">指令</th>
<th scope="col" class="org-left">说明</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">PMINSB</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">PMINSW</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">PMINSD</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">PMINUB</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">PMINUW</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">PMINUD</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">MINPS</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">MINSS</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">MINPD</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">MINSD</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">PHMINPOSUW</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>

<p>
PHMINPOSUW可以按照Unsigned Word来水平搜索最小值的位置.
</p>
</div></li></ol>
</div>

<div id="outline-container-orgheadline39" class="outline-4">
<h4 id="orgheadline39"><span class="section-number-4">3.2.6</span> Math Instructions</h4>
<div class="outline-text-4" id="text-3-2-6">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">指令</th>
<th scope="col" class="org-left">说明</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">PABSB</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">PABSW</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">PABSD</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">PAVGB</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">PAVGW</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">PSIGNB</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">PSIGNW</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">PSIGND</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">PMADDUBSW</td>
<td class="org-left">UB-&gt;W.SSM</td>
</tr>

<tr>
<td class="org-left">PMADDWD</td>
<td class="org-left">W-&gt;DW</td>
</tr>

<tr>
<td class="org-left">PALIGNR</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">PMULHRSW</td>
<td class="org-left">@@TODO</td>
</tr>

<tr>
<td class="org-left">PSADBW</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">MPSADBW</td>
<td class="org-left">@@TODO</td>
</tr>

<tr>
<td class="org-left">DPPS</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">DPPD</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">ADDSUBPS</td>
<td class="org-left">(f00,f01,..),(f10,f11,..)-&gt;(f00-f10,f01+f11,..)</td>
</tr>

<tr>
<td class="org-left">ADDSUBPD</td>
<td class="org-left">(d00,d01,..),(d10,d11,..)-&gt;(d00-d10,d01+d11,..)</td>
</tr>

<tr>
<td class="org-left">RCPPS</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">RCPSS</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">RSQRTPS</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">RSQRTSS</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">SQRTPS</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">SQRTSS</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">SQRTSD</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>

<div id="outline-container-orgheadline41" class="outline-3">
<h3 id="orgheadline41"><span class="section-number-3">3.3</span> Comparison Instructions</h3>
<div class="outline-text-3" id="text-3-3">
<p>
需要注意的是,如果没有特殊说明,比较结果是直接存放在结果数里面的,
不会影响EFLAGS这个寄存器内容.如果比较结果影响了EFLAGS寄存器的话,
那么会使用%EFLAGS来标记.
</p>

<p>
如果每个比较结果是符合预期的话,
那么目的数对应位数会置0xff,否则会置0x0.
</p>

<p>
对于CMP的指令,会使用立即数来决定具体使用什么比较方式.关于立即数对应
什么比较方式,可以查看具体指令里面的说明,比如CMPPS,CMPSS,CMPPD,CMPSD.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">指令</th>
<th scope="col" class="org-left">说明</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">PCMPEQB</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">PCMPEQW</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">PCMPEQD</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">PCMPEQQ</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">PCMPGTB</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">PCMPGTW</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">PCMPGTD</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">PCMPGTQ</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">CMPPS</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">CMPSS</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">CMPPD</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">CMPSD</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">COMISS</td>
<td class="org-left">%EFLAGS</td>
</tr>

<tr>
<td class="org-left">UCOMISS</td>
<td class="org-left">%EFLAGS</td>
</tr>

<tr>
<td class="org-left">COMISD</td>
<td class="org-left">%EFLAGS</td>
</tr>

<tr>
<td class="org-left">UCOMISD</td>
<td class="org-left">%EFLAGS</td>
</tr>

<tr>
<td class="org-left">PTEST</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgheadline42" class="outline-3">
<h3 id="orgheadline42"><span class="section-number-3">3.4</span> Conversion Instructions</h3>
<div class="outline-text-3" id="text-3-4">
<p>
对于涉及到浮点数的精度取舍问题,使用%mxccsr寄存器来判断.
</p>

<p>
如果精度取舍是采用截断方式来进行处理的话,那么指令前缀通常是CVTT.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">指令</th>
<th scope="col" class="org-left">说明</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">PACKSSWB</td>
<td class="org-left">SSM</td>
</tr>

<tr>
<td class="org-left">PACKSSDW</td>
<td class="org-left">SSM</td>
</tr>

<tr>
<td class="org-left">PACKUSDW</td>
<td class="org-left">USM</td>
</tr>
</tbody>
</table>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">指令</th>
<th scope="col" class="org-left">说明</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">CVTPS2PD</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">CVTPD2PS</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">CVTSS2SD</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">CVTSD2SS</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">CVTPI2PS</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">CVTPS2PI</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">CVTTPS2PI</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">CVTSI2SS</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">CVTSS2SI</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">CVTTSS2SI</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">CVTPI2PD</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">CVTPD2PI</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">CVTTPD2PI</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">CVTSI2SD</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">CVTSD2SI</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">CVTTSD2SI</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">CVTDQ2PS</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">CVTPS2DQ</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">CVTTPS2DQ</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">CVTDQ2PD</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">CVTPD2DQ</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">CVTTPD2DQ</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>


<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">指令</th>
<th scope="col" class="org-left">说明</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">MOVQ2DQ</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">MOVDQ2Q</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">PMOVSXBW</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">PMOVZXBW</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">PMOVSXBD</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">PMOVZXBD</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">PMOVSXWD</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">PMOVZXWD</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">PMOVSXBQ</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">PMOVZXBQ</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">PMOVSXWQ</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">PMOVZXWQ</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">PMOVSXDQ</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">PMOVZXDQ</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">指令</th>
<th scope="col" class="org-left">说明</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">ROUNDPS</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">ROUNDPD</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">ROUNDSS</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">ROUNDSD</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
